In [1]:
import pandas as pd
import numpy as np

#### 1. Create from dictionary that contains lists

In [3]:
fname = ['Paul', 'John', 'Richard', 'George']
lname = ['McCartney', 'Lennon', 'Starkey', 'Harrison']
birth = [1942, 1940, 1940, 1943]
people = {'first': fname, 'last': lname, 'birth': birth}

beatles = pd.DataFrame(people)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

#### 2. Create from list of dictionaries

In [5]:
list_of_dicts = [
    {
        'first': 'Paul',
        'last': 'McCartney',
        'birth': 1942,
    },
    {
        'first': 'John',
        'last': 'Lennon',
        'birth': 1940,
    },
    {
        'first': 'Richard',
        'last': 'Starkey',
        'birth': 1940,
    },
    {
        'first': 'George',
        'last': 'Harrison',
        'birth': 1943,
    }
]

beatles = pd.DataFrame(list_of_dicts)
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943